app/views/points/_form.html.erb

SELECT "accounts".* FROM "accounts"
---
    <%= form.label :account_id %>
    <%= form.collection_select :account_id, Account.all, :id, :FirstName %>