app/views/events/_form.html.erb

    <%= form.label :type_id %>
    <%= form.collection_select :type_id, Type.all, :id, :Value %>
---
SELECT "types".* FROM "types"