app/controllers/accounts_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."Email" = $1 LIMIT $2  [["Email", "rishavkrd11@tamu.edu"], ["LIMIT", 1]]
---
  def index
    @accounts = Account.all
    @current_user = @accounts.find_by Email: get_user_email

INSERT INTO "accounts" ("UIN", "FirstName", "LastName", "PhoneNumber", "Email", "status_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @account = Account.new(account_params)

    respond_to do |format|
      if @account.save

UPDATE "accounts" SET "Email" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["Email", "asdfrishavkrd11@tamu.edu"], ["updated_at", "2022-10-13 01:24:49.638300"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @account.update(account_params)