app/controllers/accounts_controller.rb

SELECT "accounts".* FROM "accounts"
SELECT "accounts".* FROM "accounts" WHERE "accounts"."uuid" = $1 LIMIT $2  [["uuid", "auth0|6328e837ac12bb168612e905"], ["LIMIT", 1]]
---
  def index

    @accounts = Account.all
    @current_user = @accounts.find_by uuid: session[:useruuid]

SELECT "accounts".* FROM "accounts" WHERE "accounts"."uuid" = $1 LIMIT $2  [["uuid", "auth0|6328e837ac12bb168612e905"], ["LIMIT", 1]]
SELECT "points".* FROM "points" WHERE "points"."account_id" = $1 LIMIT $2  [["account_id", 2], ["LIMIT", 1]]
SELECT SUM("points"."Points") FROM "points" WHERE "points"."account_id" = $1  [["account_id", 8]]
---
  def show
    @accounts = Account.all
    @current_user = @accounts.find_by uuid: session[:useruuid]
    if @current_user.status_id == 1 or @current_user.status_id == 2 or @current_user.id == @account.id
      @points = Point.all
      @mypoints=@points.where(account_id: @account.id)
      @total_points = @mypoints.all.sum (:Points)

INSERT INTO "accounts" ("UIN", "FirstName", "LastName", "PhoneNumber", "Email", "status_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @account = Account.new(account_params)

    respond_to do |format|
      if @account.save

UPDATE "accounts" SET "status_id" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["status_id", 3], ["updated_at", "2022-10-17 21:10:33.103249"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @account.update(account_params)

UPDATE "accounts" SET "status_id" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["status_id", 3], ["updated_at", "2022-10-17 21:10:33.103249"], ["id", 1]]
---
  def destroy
    # @account.destroy!
    @account.update(:status_id => 4)