app/controllers/accounts_controller.rb

  def show
    @accounts = Account.all
    @registered_events = Signup.where(account_id: @account.id)
    @registered_events_count = @registered_events.size
---
SELECT "signups".* FROM "signups" WHERE "signups"."account_id" = $1  [["account_id", 8]]
SELECT COUNT(*) FROM "signups" WHERE "signups"."account_id" = $1  [["account_id", 8]]