app/controllers/auth0_controller.rb

  def find_or_create
    user_uid = session[:useruuid]
    @user = session[:userinfo]
    user_email = @user['email']
    user = Account.find_by(uuid: user_uid)
    user_by_email = Account.find_by(Email: user_email)
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."uuid" = $1 LIMIT $2  [["uuid", "auth0|6328e837ac12bb168612e905"], ["LIMIT", 1]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."Email" = $1 LIMIT $2  [["Email", "rishavkrd11@tamu.edu"], ["LIMIT", 1]]