app/controllers/dashboard_controller.rb

  def show
    @user = session[:userinfo]
    @uid = session[:useruuid]
    @events = Event.where("? >= ?",:Date, Time.now).order(:Date)
    usr_email = @user['email']
    @account = Account.find_by uuid: session[:useruuid]
    @mypoints=Point.where(account_id: @account.id)
    @total_points = @mypoints.all.sum (:Points)

    @registered_events = Signup.where(account_id: @account.id).size
---
SELECT "events".* FROM "events" WHERE (date >= '2022-11-13 23:05:34.829254') LIMIT $1  [["LIMIT", 1]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."uuid" = $1 LIMIT $2  [["uuid", "auth0|6328e837ac12bb168612e905"], ["LIMIT", 1]]
SELECT SUM("points"."Points") FROM "points" WHERE "points"."account_id" = $1  [["account_id", 8]]
SELECT COUNT(*) FROM "signups" WHERE "signups"."account_id" = $1  [["account_id", 8]]