app/controllers/dashboard_controller.rb

  def show
    @user = session[:userinfo]
    @events = Event.all
    usr_email = @user['email']
    @account = Account.find_by(Email: usr_email)
---
SELECT "events".* FROM "events"
SELECT "accounts".* FROM "accounts" WHERE "accounts"."Email" = $1 LIMIT $2  [["Email", "darmenta258@tamu.edu"], ["LIMIT", 1]]