app/controllers/events_controller.rb

SELECT "signups".* FROM "signups"
SELECT "accounts".* FROM "accounts" WHERE "accounts"."Email" = $1 LIMIT $2  [["Email", "rdomalley@tamu.edu"], ["LIMIT", 1]]
---
  def show
    @current_user = Account.find_by uuid: session[:useruuid]
    @signups = Signup.all
    @user = session[:userinfo]
    usr_email = @user['email']
    @account = Account.find_by(Email: usr_email)