app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("Title", "Description", "Date", "Time", "Location", "Points", "type_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    respond_to do |format|
      if @event.update(event_params)
---
UPDATE "events" SET "Title" = $1, "Description" = $2, "Time" = $3, "Location" = $4, "updated_at" = $5 WHERE "events"."id" = $6  [["Title", "Meetup with team"], ["Description", "Meet the officers and members of AggieRotaract"], ["Time", "21:45:00"], ["Location", "MSC"], ["updated_at", "2022-10-13 01:34:44.915185"], ["id", 1]]

  def destroy
    # @event.destroy!
    @event.update(:type_id => 5)
---
UPDATE "events" SET "type_id" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["type_id", 5], ["updated_at", "2022-10-17 02:57:46.185567"], ["id", 1]]