app/controllers/points_controller.rb

  def index
    @current_user = Account.find_by uuid: session[:useruuid]
    unless @current_user.status_id == 1
      redirect_to "/dashboard"
    end
    @points = Point.all
---
SELECT "points".* FROM "points"

  def new
    @point = Point.new
    @account = Account.find(params[:account_id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def create
    @point = Point.new(point_params)
    event_points = Event.find(@point.event_id).Points
    @point.Points = event_points

    respond_to do |format|
      if Point.find_by(event_id: @point.event_id, account_id: @point.account_id)
        format.html { redirect_back fallback_location: '/dashboard', error: 'User has already been marked present.' }
      elsif @point.save
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "points" ("account_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["account_id", 7], ["event_id", 1], ["created_at", "2022-10-17 17:45:38.056293"], ["updated_at", "2022-10-17 17:45:38.056293"]]
UPDATE "points" SET "updated_at" = $1, "Points" = $2 WHERE "points"."id" = $3  [["updated_at", "2022-10-26 20:48:51.241326"], ["Points", 2], ["id", 1]]

  def update
    respond_to do |format|
      if @point.update(point_params)
---
UPDATE "points" SET "updated_at" = $1, "Points" = $2 WHERE "points"."id" = $3  [["updated_at", "2022-10-26 20:48:51.241326"], ["Points", 2], ["id", 1]]

  def set_point
    @point = Point.find(params[:id])
---
SELECT "points".* FROM "points" WHERE "points"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]