app/controllers/points_controller.rb

SELECT "accounts".* FROM "accounts"
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def new
    @accounts = Account.all
    @current_user = @accounts.find_by uuid: session[:useruuid]
    @point = Point.new
    @account = Account.find(params[:account_id])

SELECT "accounts".* FROM "accounts"
---
  def edit
    @accounts = Account.all