app/controllers/profile_controller.rb

  def new
    member_id = Status.where(Value: 'Member').pick(:id)
    @account = Account.new(:UIN => params[:account][:UIN], :FirstName => params[:account][:FirstName], :LastName => params[:account][:LastName], :PhoneNumber => params[:account][:PhoneNumber], :Email => get_user_email, :status_id => member_id, :uuid => session[:useruuid])
    respond_to do |format|
      if @account.save
---
SELECT "statuses"."id" FROM "statuses" WHERE "statuses"."Value" = $1 LIMIT $2  [["Value", "Member"], ["LIMIT", 1]]
INSERT INTO "statuses" ("Value", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["Value", "officer"], ["created_at", "2022-10-15 17:53:55.323426"], ["updated_at", "2022-10-15 17:53:55.323426"]]
INSERT INTO "accounts" ("UIN", "FirstName", "LastName", "PhoneNumber", "Email", "status_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"