app/controllers/profile_controller.rb

SELECT "statuses"."id" FROM "statuses" WHERE "statuses"."Value" = $1 LIMIT $2  [["Value", "Member"], ["LIMIT", 1]]
---
  def new
    member_id = Status.where(Value: 'Member').pick(:id)