app/controllers/signups_controller.rb

  def destroy
    @signup.destroy
---
DELETE FROM "signups" WHERE "signups"."id" = $1  [["id", 1]]

    def set_signup
      @signup = Signup.find(params[:id])
---
SELECT "signups".* FROM "signups" WHERE "signups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]