app/controllers/signups_controller.rb

  def new
    @signup = Signup.new
    @account_id = params[:account_id]
    @event_id = params[:event_id]
    @account = Account.find(params[:account_id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]