app/controllers/signups_controller.rb

SELECT "signups".* FROM "signups"
---
  def index
    @signups = Signup.all

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @signup = Signup.new
    @account = Account.find(params[:account_id])

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "signups" ("event_id", "account_id", "Pickup", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["event_id", 1], ["account_id", 8], ["Pickup", false], ["created_at", "2022-11-13 23:49:40.041631"], ["updated_at", "2022-11-13 23:49:40.041631"]]
---
  def create
    @signup = Signup.new(signup_params)
    eventDateTime = DateTime.new(@signup.event.Date.year, @signup.event.Date.month, @signup.event.Date.day, @signup.event.Time.hour, @signup.event.Time.min, @signup.event.Time.sec)
    cutoffDateTime = eventDateTime - (6/24.0)
    signupTime = DateTime.now.in_time_zone("Central Time (US & Canada)")
    convertedTime = DateTime.new(signupTime.year, signupTime.month, signupTime.day, signupTime.hour, signupTime.min, signupTime.sec)
    if (convertedTime > cutoffDateTime)
      respond_to do |format|
        format.html { redirect_to({ :action => "new"}, notice: "Cannot sign up for event within 6 hours of start time") }
        format.json { render :new, status: :unprocessable_entity, location: @signup }
      end
    else
      respond_to do |format|
        if (@signup.save)

DELETE FROM "signups" WHERE "signups"."id" = $1  [["id", 1]]
---
  def destroy
    @signup.destroy!

SELECT "signups".* FROM "signups" WHERE "signups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_signup
    @signup = Signup.find(params[:id])