app/controllers/statuses_controller.rb

  def create
    @status = Status.new(status_params)

    respond_to do |format|
      if @status.save
---
INSERT INTO "statuses" ("Value", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["Value", "Officer"], ["created_at", "2022-10-05 20:56:01.231824"], ["updated_at", "2022-10-05 20:56:01.231824"]]