app/controllers/types_controller.rb

SELECT "types".* FROM "types"
---
  def index
    @current_user = Account.find_by(uuid: session[:useruuid])
    redirect_to('/dashboard') unless @current_user.status_id == 1
    @types = Type.all

INSERT INTO "types" ("Value", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["Value", "2"], ["created_at", "2022-10-13 01:35:17.740798"], ["updated_at", "2022-10-13 01:35:17.740798"]]
---
  def create
    @type = Type.new(type_params)

    respond_to do |format|
      if @type.save

UPDATE "types" SET "Value" = $1, "updated_at" = $2 WHERE "types"."id" = $3  [["Value", "Meeting"], ["updated_at", "2022-10-13 01:35:39.266429"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @type.update(type_params)

SELECT "types".* FROM "types" WHERE "types"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def set_type
    @type = Type.find(params[:id])