app/controllers/concerns/secured.rb

  def logged_in_using_omniauth?
    redirect_to('/') if session[:userinfo].blank?
    if session[:userinfo].present?
      @user = session[:userinfo]
      user_email = @user['email']
      user_uid = session[:useruuid]
      user = Account.find_by(uuid: user_uid)
      user_by_email = Account.find_by(Email: user_email)
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."Email" = $1 LIMIT $2  [["Email", "darmenta258@tamu.edu"], ["LIMIT", 1]]