app/views/accounts/_form.html.erb

SELECT "statuses".* FROM "statuses"
---
    <%= form.label :status_id %>
    <%= form.collection_select :status_id, Status.all, :id, :Value %>