app/views/accounts/show.html.erb

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
							<tr>
								<td><%= Event.find(signup.event_id).Title %></td>
								<td><%= Event.find(signup.event_id).Date.strftime("%b %-d") %> <%= Event.find(signup.event_id).Time.strftime("%-I:%M %p") %></td>